tangyangguang/Esp32Base/src/network/Esp32BaseWiFi.inc
uint32_t retryDelayMs() {
    if (g_wifiRetryCount < ESP32BASE_WIFI_RETRY_FAST_COUNT) {
        return ESP32BASE_WIFI_RETRY_FAST_MS;
    }
    return ESP32BASE_WIFI_RETRY_SLOW_MS;
}

void publish(const char* event) {
#if ESP32BASE_ENABLE_BUS
    Esp32BaseBus::publish(event, "");
#else
    (void)event;
#endif
}

bool loadCredentials() {
    if (!Esp32BaseConfig::getStr(WIFI_NS, WIFI_KEY_SSID, g_wifiSsid, sizeof(g_wifiSsid), "") ||
        !Esp32BaseConfig::getStr(WIFI_NS, WIFI_KEY_PASS, g_wifiPassword, sizeof(g_wifiPassword), "")) {
        g_wifiSsid[0] = '\0';
        g_wifiPassword[0] = '\0';
        return false;
    }
    return credentialsPresent();
}

bool safeBootEnabled() {
    return ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS > 0;
}

void loadStaSafeBootState() {
    g_staGuardActive = Esp32BaseConfig::getBool(WIFI_NS, WIFI_KEY_STA_GUARD, false);
    g_staCredentialsPaused = Esp32BaseConfig::getBool(WIFI_NS, WIFI_KEY_STA_PAUSE, false);
    const int32_t storedCount = Esp32BaseConfig::getInt(WIFI_NS, WIFI_KEY_STA_RESET_COUNT, 0);
    if (storedCount < 0) {
        g_staGuardedResetCount = 0;
    } else if (storedCount > 255) {
        g_staGuardedResetCount = 255;
    } else {
        g_staGuardedResetCount = static_cast<uint8_t>(storedCount);
    }

    g_wifiInitGuardActive = Esp32BaseConfig::getBool(WIFI_NS, WIFI_KEY_INIT_GUARD, false);
    g_wifiInitPaused = Esp32BaseConfig::getBool(WIFI_NS, WIFI_KEY_INIT_PAUSE, false);
    const int32_t storedInitCount = Esp32BaseConfig::getInt(WIFI_NS, WIFI_KEY_INIT_RESET_COUNT, 0);
    if (storedInitCount < 0) {
        g_wifiInitGuardedResetCount = 0;
    } else if (storedInitCount > 255) {
        g_wifiInitGuardedResetCount = 255;
    } else {
        g_wifiInitGuardedResetCount = static_cast<uint8_t>(storedInitCount);
    }
}

bool persistBoolIfNonDefault(const char* key, bool value) {
    const bool stored = Esp32BaseConfig::getBool(WIFI_NS, key, false);
    if (!value && !stored) {
        return true;
    }
    return Esp32BaseConfig::setBool(WIFI_NS, key, value);
}

bool persistIntIfNonDefault(const char* key, uint8_t value) {
    const int32_t stored = Esp32BaseConfig::getInt(WIFI_NS, key, 0);
    if (value == 0 && stored == 0) {
        return true;
    }
    return Esp32BaseConfig::setInt(WIFI_NS, key, value);
}

bool persistStaSafeBootState() {
    bool ok = true;
    ok = persistBoolIfNonDefault(WIFI_KEY_STA_GUARD, g_staGuardActive) && ok;
    ok = persistIntIfNonDefault(WIFI_KEY_STA_RESET_COUNT, g_staGuardedResetCount) && ok;
    ok = persistBoolIfNonDefault(WIFI_KEY_STA_PAUSE, g_staCredentialsPaused) && ok;
    if (!ok) {
        ESP32BASE_LOG_W("wifi", "sta_safe_boot_state_save_failed guard=%s resets=%u paused=%s",
                        g_staGuardActive ? "yes" : "no",
                        static_cast<unsigned>(g_staGuardedResetCount),
                        g_staCredentialsPaused ? "yes" : "no");
    }
    return ok;
}

bool persistWiFiInitSafeBootState() {
    bool ok = true;
    ok = persistBoolIfNonDefault(WIFI_KEY_INIT_GUARD, g_wifiInitGuardActive) && ok;
    ok = persistIntIfNonDefault(WIFI_KEY_INIT_RESET_COUNT, g_wifiInitGuardedResetCount) && ok;
    ok = persistBoolIfNonDefault(WIFI_KEY_INIT_PAUSE, g_wifiInitPaused) && ok;
    if (!ok) {
        ESP32BASE_LOG_W("wifi", "wifi_init_safe_boot_state_save_failed guard=%s resets=%u paused=%s",
                        g_wifiInitGuardActive ? "yes" : "no",
                        static_cast<unsigned>(g_wifiInitGuardedResetCount),
                        g_wifiInitPaused ? "yes" : "no");
    }
    return ok;
}

void clearStaSafeBootState(const char* reason) {
    const bool hadState = g_staGuardActive || g_staCredentialsPaused || g_staGuardedResetCount != 0;
    const uint8_t previousCount = g_staGuardedResetCount;
    const bool previousPaused = g_staCredentialsPaused;
    g_staGuardActive = false;
    g_staGuardedResetCount = 0;
    g_staCredentialsPaused = false;
    if (hadState) {
        persistStaSafeBootState();
    }
    if (hadState) {
        ESP32BASE_LOG_I("wifi", "sta_safe_boot_cleared reason=%s previous_resets=%u previous_paused=%s",
                        reason ? reason : "unknown",
                        static_cast<unsigned>(previousCount),
                        previousPaused ? "yes" : "no");
    }
}

void clearWiFiInitSafeBootState(const char* reason) {
    const bool hadState = g_wifiInitGuardActive || g_wifiInitPaused || g_wifiInitGuardedResetCount != 0;
    const uint8_t previousCount = g_wifiInitGuardedResetCount;
    const bool previousPaused = g_wifiInitPaused;
    g_wifiInitGuardActive = false;
    g_wifiInitGuardedResetCount = 0;
    g_wifiInitPaused = false;
    if (hadState) {
        persistWiFiInitSafeBootState();
        ESP32BASE_LOG_I("wifi", "wifi_init_safe_boot_cleared reason=%s previous_resets=%u previous_paused=%s",
                        reason ? reason : "unknown",
                        static_cast<unsigned>(previousCount),
                        previousPaused ? "yes" : "no");
    }
}

void resumeStaCredentials(const char* reason) {
    const bool wasPaused = g_staCredentialsPaused;
    clearStaSafeBootState(reason);
    clearWiFiInitSafeBootState(reason);
    if (wasPaused) {
        ESP32BASE_LOG_I("wifi", "sta_safe_boot_resume reason=%s ssid=%s", reason ? reason : "unknown", g_wifiSsid);
    }
}

bool guardedResetReason(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_BROWNOUT:
        case ESP_RST_PANIC:
        case ESP_RST_INT_WDT:
        case ESP_RST_TASK_WDT:
        case ESP_RST_WDT:
            return true;
        default:
            return false;
    }
}

bool wifiInitGuardedResetReason(esp_reset_reason_t reason) {
    return guardedResetReason(reason) || reason == ESP_RST_SW;
}

void logWiFiInitPowerWarning() {
    ESP32BASE_LOG_W("wifi",
                    "电源风险：疑似 WiFi/RF 启动瞬时电流导致供电跌落。请检查电源、USB线、稳压器余量和接线，并考虑在板端 VIN/5V 与 GND 间增加低 ESR 储能电容；不会关闭 brownout detector。");
}

void autoResumeStaCredentialsForSafeBoot(const char* reason, uint8_t previousCount) {
    ESP32BASE_LOG_I("wifi",
                    "sta_safe_boot_auto_resume ssid=%s reason=%s previous_resets=%u action=retry_sta",
                    g_wifiSsid,
                    reason ? reason : "unknown",
                    static_cast<unsigned>(previousCount));
    clearStaSafeBootState("normal_reset_auto_resume");
}

void pauseStaCredentialsForSafeBoot(const char* reason, uint8_t guardedResetCount) {
    g_staGuardActive = false;
    g_staCredentialsPaused = true;
    g_staGuardedResetCount = guardedResetCount;
    persistStaSafeBootState();
    ESP32BASE_LOG_W("wifi",
                    "sta_safe_boot_pause ssid=%s reason=%s guarded_resets=%u max=%u action=config_portal credentials=paused",
                    g_wifiSsid,
                    reason ? reason : "unknown",
                    static_cast<unsigned>(g_staGuardedResetCount),
                    static_cast<unsigned>(ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS));
    publish(Esp32BaseWiFi::EVENT_FAILED);
}

