tangyangguang/Esp32Base/src/network/Esp32BaseWiFi.inc
void pauseWiFiInitForSafeBoot(const char* reason, uint8_t guardedResetCount) {
    g_wifiInitGuardActive = false;
    g_wifiInitPaused = true;
    g_wifiInitGuardedResetCount = guardedResetCount;
    persistWiFiInitSafeBootState();
    ESP32BASE_LOG_W("wifi",
                    "wifi_init_safe_boot_pause reason=%s guarded_resets=%u max=%u action=skip_wifi",
                    reason ? reason : "unknown",
                    static_cast<unsigned>(g_wifiInitGuardedResetCount),
                    static_cast<unsigned>(ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS));
    logWiFiInitPowerWarning();
    publish(Esp32BaseWiFi::EVENT_FAILED);
}

bool evaluateWiFiInitSafeBootBeforeArduinoWiFi() {
    if (!safeBootEnabled()) {
        if (g_wifiInitGuardActive || g_wifiInitPaused || g_wifiInitGuardedResetCount != 0) {
            clearWiFiInitSafeBootState("safe_boot_disabled");
        }
        return true;
    }

    const esp_reset_reason_t reason = esp_reset_reason();
    if (g_wifiInitPaused) {
        if (!wifiInitGuardedResetReason(reason)) {
            ESP32BASE_LOG_I("wifi",
                            "wifi_init_safe_boot_auto_resume reason=%s previous_resets=%u action=retry_wifi_init",
                            esp32base_internal::resetReasonName(reason),
                            static_cast<unsigned>(g_wifiInitGuardedResetCount));
            clearWiFiInitSafeBootState("normal_reset_auto_resume");
            return true;
        }
        ESP32BASE_LOG_W("wifi",
                        "wifi_init_safe_boot_paused reset_reason=%s guarded_resets=%u action=skip_wifi",
                        esp32base_internal::resetReasonName(reason),
                        static_cast<unsigned>(g_wifiInitGuardedResetCount));
        logWiFiInitPowerWarning();
        return false;
    }

    if (!g_wifiInitGuardActive) {
        return true;
    }
    if (!wifiInitGuardedResetReason(reason)) {
        ESP32BASE_LOG_I("wifi", "wifi_init_safe_boot_previous_guard_ignored reset_reason=%s action=retry_wifi_init",
                        esp32base_internal::resetReasonName(reason));
        clearWiFiInitSafeBootState("normal_reset");
        return true;
    }
    if (g_wifiInitGuardedResetCount < 255) {
        ++g_wifiInitGuardedResetCount;
    }
    if (g_wifiInitGuardedResetCount >= ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS) {
        pauseWiFiInitForSafeBoot(esp32base_internal::resetReasonName(reason), g_wifiInitGuardedResetCount);
        return false;
    }
    persistWiFiInitSafeBootState();
    ESP32BASE_LOG_W("wifi",
                    "wifi_init_safe_boot_guarded_reset reset_reason=%s guarded_resets=%u max=%u action=retry_wifi_init",
                    esp32base_internal::resetReasonName(reason),
                    static_cast<unsigned>(g_wifiInitGuardedResetCount),
                    static_cast<unsigned>(ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS));
    return true;
}

void markWiFiInitSafeBootGuardActive() {
    if (!safeBootEnabled() || g_wifiInitGuardActive) {
        return;
    }
    g_wifiInitGuardActive = true;
    persistWiFiInitSafeBootState();
    ESP32BASE_LOG_I("wifi", "wifi_init_safe_boot_guard_set max=%u",
                    static_cast<unsigned>(ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS));
}

bool evaluateStaSafeBootBeforeSta() {
    if (!safeBootEnabled()) {
        if (g_staGuardActive || g_staCredentialsPaused || g_staGuardedResetCount != 0) {
            clearStaSafeBootState("safe_boot_disabled");
        }
        return true;
    }
    if (g_staCredentialsPaused) {
        const esp_reset_reason_t reason = esp_reset_reason();
        if (!guardedResetReason(reason)) {
            autoResumeStaCredentialsForSafeBoot(esp32base_internal::resetReasonName(reason), g_staGuardedResetCount);
            return true;
        }
        ESP32BASE_LOG_W("wifi",
                        "sta_safe_boot_paused ssid=%s reset_reason=%s guarded_resets=%u action=config_portal",
                        g_wifiSsid,
                        esp32base_internal::resetReasonName(reason),
                        static_cast<unsigned>(g_staGuardedResetCount));
        return false;
    }
    if (!g_staGuardActive) {
        return true;
    }
    const esp_reset_reason_t reason = esp_reset_reason();
    if (!guardedResetReason(reason)) {
        ESP32BASE_LOG_I("wifi", "sta_safe_boot_previous_guard_ignored reset_reason=%s action=retry_sta",
                        esp32base_internal::resetReasonName(reason));
        clearStaSafeBootState("normal_reset");
        return true;
    }
    if (g_staGuardedResetCount < 255) {
        ++g_staGuardedResetCount;
    }
    if (g_staGuardedResetCount >= ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS) {
        pauseStaCredentialsForSafeBoot(esp32base_internal::resetReasonName(reason), g_staGuardedResetCount);
        return false;
    }
    persistStaSafeBootState();
    ESP32BASE_LOG_W("wifi",
                    "sta_safe_boot_guarded_reset ssid=%s reset_reason=%s guarded_resets=%u max=%u action=retry_sta",
                    g_wifiSsid,
                    esp32base_internal::resetReasonName(reason),
                    static_cast<unsigned>(g_staGuardedResetCount),
                    static_cast<unsigned>(ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS));
    return true;
}

void markStaSafeBootGuardActive() {
    if (!safeBootEnabled() || g_staGuardActive) {
        return;
    }
    g_staGuardActive = true;
    persistStaSafeBootState();
    ESP32BASE_LOG_I("wifi", "sta_safe_boot_guard_set ssid=%s max=%u",
                    g_wifiSsid,
                    static_cast<unsigned>(ESP32BASE_WIFI_SAFE_BOOT_MAX_RESETS));
}

bool beginSta() {
    if (!credentialsPresent()) {
        g_wifiState = Esp32BaseWiFi::IDLE;
        ESP32BASE_LOG_W("wifi", "sta connect skipped: no credentials");
        return false;
    }
    markStaSafeBootGuardActive();
    if (!WiFi.mode(WIFI_STA)) {
        g_wifiState = Esp32BaseWiFi::FAILED;
        ESP32BASE_LOG_E("wifi", "station_mode_failed ssid=%s action=config_portal", g_wifiSsid);
        pauseStaCredentialsForSafeBoot("mode_failed", g_staGuardedResetCount);
        return false;
    }
    if (!WiFi.setHostname(Esp32Base::hostname())) {
        ESP32BASE_LOG_W("wifi", "hostname_apply_failed value=%s", Esp32Base::hostname());
    }
    if (g_wifiAttemptCount != UINT32_MAX) ++g_wifiAttemptCount;
    if (g_wifiPassword[0]) {
        WiFi.begin(g_wifiSsid, g_wifiPassword);
    } else {
        WiFi.begin(g_wifiSsid);
    }
    g_wifiAttemptStartMs = millis();
    g_wifiDhcpWaitStartMs = 0;
    g_wifiWaitingForIp = false;
    g_wifiState = Esp32BaseWiFi::CONNECTING;
    ESP32BASE_LOG_I("wifi", "station_connecting ssid=%s password_set=%s status=%s status_code=%u",
                    g_wifiSsid,
                    g_wifiPassword[0] ? "yes" : "no",
                    wlStatusName(WiFi.status()),
                    static_cast<unsigned>(WiFi.status()));
    return true;
}

void scheduleRetry(uint32_t now, const char* reason) {
    g_wifiDhcpWaitStartMs = 0;
    g_wifiWaitingForIp = false;
    g_wifiState = Esp32BaseWiFi::RETRY_BACKOFF;
    const uint32_t delayMs = retryDelayMs();
    const bool slowBackoff = g_wifiRetryCount >= ESP32BASE_WIFI_RETRY_FAST_COUNT;
    g_wifiNextRetryMs = now + delayMs;
    if (slowBackoff) {
        ESP32BASE_LOG_I("wifi", "%s attempt=%u retry_in=%lu ms mode=%s status=%s status_code=%u rssi=%ld",
                        reason,
                        static_cast<unsigned>(g_wifiRetryCount + 1),
                        static_cast<unsigned long>(delayMs),
                        "slow",
                        wlStatusName(WiFi.status()),
                        static_cast<unsigned>(WiFi.status()),
                        static_cast<long>(WiFi.RSSI()));
    } else {
        ESP32BASE_LOG_W("wifi", "%s attempt=%u retry_in=%lu ms mode=%s status=%s status_code=%u rssi=%ld",
                        reason,
                        static_cast<unsigned>(g_wifiRetryCount + 1),
                        static_cast<unsigned long>(delayMs),
                        "fast",
                        wlStatusName(WiFi.status()),
                        static_cast<unsigned>(WiFi.status()),
                        static_cast<long>(WiFi.RSSI()));
    }
    publish(Esp32BaseWiFi::EVENT_RETRY);
}

const char* wlStatusName(wl_status_t status) {
    switch (status) {
        case WL_IDLE_STATUS: return "WL_IDLE_STATUS";
        case WL_NO_SSID_AVAIL: return "WL_NO_SSID_AVAIL";
        case WL_SCAN_COMPLETED: return "WL_SCAN_COMPLETED";
        case WL_CONNECTED: return "WL_CONNECTED";
        case WL_CONNECT_FAILED: return "WL_CONNECT_FAILED";
        case WL_CONNECTION_LOST: return "WL_CONNECTION_LOST";
        case WL_DISCONNECTED: return "WL_DISCONNECTED";
        default: return "WL_UNKNOWN";
    }
}
}

bool Esp32BaseWiFi::begin() {
    g_wifiReady = true;
#if ESP32BASE_ENABLE_WIFI_RECOVERY_BUTTON
    loadRecoveryButtonConfig();
#endif
    const bool hasCredentials = loadCredentials();
    loadStaSafeBootState();
    if (!evaluateWiFiInitSafeBootBeforeArduinoWiFi()) {
        g_wifiState = FAILED;
        return true;
    }
    markWiFiInitSafeBootGuardActive();
    WiFi.persistent(false);
    WiFi.setSleep(g_wifiPowerSave);
    if (hasCredentials) {
        if (evaluateStaSafeBootBeforeSta()) {
            if (!beginSta()) {
                startConfigPortal();
            }
        } else {
            startConfigPortal();
        }
    } else {
        clearStaSafeBootState("no_credentials");
        startConfigPortal();
    }
    clearWiFiInitSafeBootState("wifi_begin_completed");
    return true;
}

void Esp32BaseWiFi::handle() {
    if (!g_wifiReady) {
        return;
    }
#if ESP32BASE_ENABLE_WIFI_RECOVERY_BUTTON
    handleRecoveryButton();
#endif
    const wl_status_t status = WiFi.status();
    const uint32_t now = millis();
    if ((g_wifiState == CONNECTING || g_wifiState == RETRY_BACKOFF) && status == WL_CONNECTED) {
        g_wifiDhcpWaitStartMs = 0;
        g_wifiWaitingForIp = false;
        g_wifiState = CONNECTED;
        g_wifiRetryCount = 0;
        clearStaSafeBootState("connected");
        char ipAddress[16];
        formatIpv4(WiFi.localIP(), ipAddress, sizeof(ipAddress));
        ESP32BASE_LOG_I("wifi", "connected ip=%s", ipAddress);
        publish(EVENT_CONNECTED);
        return;
    }
    if (g_wifiState == CONNECTED && status != WL_CONNECTED) {
        if (status == WL_IDLE_STATUS) {
            g_wifiState = CONNECTING;
            g_wifiAttemptStartMs = now;
            g_wifiDhcpWaitStartMs = now;
            g_wifiWaitingForIp = true;
            ESP32BASE_LOG_W("wifi", "station_ip_lost status=%s status_code=%u action=wait_for_dhcp timeout=%lu ms rssi=%ld",
                            wlStatusName(status),
                            static_cast<unsigned>(status),
                            static_cast<unsigned long>(ESP32BASE_WIFI_DHCP_TIMEOUT_MS),
                            static_cast<long>(WiFi.RSSI()));
            publish(EVENT_DISCONNECTED);
            return;
        }
        ESP32BASE_LOG_W("wifi", "station_disconnected status=%s status_code=%u rssi=%ld",
                        wlStatusName(status), static_cast<unsigned>(status), static_cast<long>(WiFi.RSSI()));
        publish(EVENT_DISCONNECTED);
        scheduleRetry(now, "connection lost");
        return;
    }
    if (g_wifiState == CONNECTING && status == WL_IDLE_STATUS) {
        if (!g_wifiWaitingForIp) {
            g_wifiDhcpWaitStartMs = now;
            g_wifiWaitingForIp = true;
            ESP32BASE_LOG_I("wifi", "station_associated_waiting_for_ip ssid=%s timeout=%lu ms rssi=%ld",
                            g_wifiSsid,
                            static_cast<unsigned long>(ESP32BASE_WIFI_DHCP_TIMEOUT_MS),
                            static_cast<long>(WiFi.RSSI()));
        }
        if (static_cast<int32_t>(now - g_wifiDhcpWaitStartMs) >= ESP32BASE_WIFI_DHCP_TIMEOUT_MS) {
            ESP32BASE_LOG_W("wifi", "station_dhcp_timeout ssid=%s elapsed=%lu ms rssi=%ld",
                            g_wifiSsid,
                            static_cast<unsigned long>(now - g_wifiDhcpWaitStartMs),
                            static_cast<long>(WiFi.RSSI()));
            scheduleRetry(now, "dhcp timeout");
        }
        return;
    }
    if (g_wifiWaitingForIp) {
        g_wifiDhcpWaitStartMs = 0;
        g_wifiWaitingForIp = false;
    }
    if (g_wifiState == CONNECTING && status != WL_CONNECTED &&
        static_cast<int32_t>(now - g_wifiAttemptStartMs) >= ESP32BASE_WIFI_CONNECT_TIMEOUT_MS) {
        const bool slowBackoff = g_wifiRetryCount >= ESP32BASE_WIFI_RETRY_FAST_COUNT;
        if (slowBackoff) {
            ESP32BASE_LOG_I("wifi", "station_connect_timeout ssid=%s status=%s status_code=%u elapsed=%lu ms rssi=%ld retry_phase=slow",
                            g_wifiSsid,
                            wlStatusName(status),
                            static_cast<unsigned>(status),
                            static_cast<unsigned long>(now - g_wifiAttemptStartMs),
                            static_cast<long>(WiFi.RSSI()));
        } else {
            ESP32BASE_LOG_W("wifi", "station_connect_timeout ssid=%s status=%s status_code=%u elapsed=%lu ms rssi=%ld retry_phase=fast",
                            g_wifiSsid,
                            wlStatusName(status),
                            static_cast<unsigned>(status),
                            static_cast<unsigned long>(now - g_wifiAttemptStartMs),
                            static_cast<long>(WiFi.RSSI()));
        }
        scheduleRetry(now, "connect timeout");
        return;
    }
    if (g_wifiState == RETRY_BACKOFF && status != WL_CONNECTED &&
        static_cast<int32_t>(now - g_wifiNextRetryMs) >= 0) {
        if (!credentialsPresent()) {
            g_wifiState = IDLE;
            ESP32BASE_LOG_W("wifi", "retry stopped: no credentials");
            return;
        }
        ++g_wifiRetryCount;
        if (!beginSta()) {
            startConfigPortal();
        }
    }
}

bool Esp32BaseWiFi::isReady() {
    return g_wifiReady;
}

bool Esp32BaseWiFi::connect(const char* ssidValue, const char* passwordValue, bool persist) {
    if (!credentialsValid(ssidValue, passwordValue)) {
        ESP32BASE_LOG_W("wifi", "reject invalid ssid/password");
        return false;
    }
    if (persist) {
        // Explicit credential saves stay synchronous so a reboot right after the form submit keeps the new WiFi config.
        if (!Esp32BaseConfig::setStr(WIFI_NS, WIFI_KEY_PASS, passwordValue) ||
            !Esp32BaseConfig::setStr(WIFI_NS, WIFI_KEY_SSID, ssidValue)) {
            ESP32BASE_LOG_E("wifi", "credential save failed");
            return false;
        }
        char verifySsid[33] = "";
        char verifyPassword[65] = "";
        Esp32BaseConfig::getStr(WIFI_NS, WIFI_KEY_SSID, verifySsid, sizeof(verifySsid), "");
        Esp32BaseConfig::getStr(WIFI_NS, WIFI_KEY_PASS, verifyPassword, sizeof(verifyPassword), "");
        if (strcmp(verifySsid, ssidValue) != 0 || strcmp(verifyPassword, passwordValue) != 0) {
            ESP32BASE_LOG_E("wifi", "credential save verify failed");
            return false;
        }
    }
    strlcpy(g_wifiSsid, ssidValue, sizeof(g_wifiSsid));
    strlcpy(g_wifiPassword, passwordValue, sizeof(g_wifiPassword));
    ESP32BASE_LOG_I("wifi", "credentials_set ssid=%s password_set=%s persist=%s",
                    g_wifiSsid,
                    g_wifiPassword[0] ? "yes" : "no",
                    persist ? "yes" : "no");
    g_wifiRetryCount = 0;
    resumeStaCredentials("credentials_set");
    stopConfigPortal();
    if (beginSta()) {
        return true;
    }
    startConfigPortal();
    return false;
}

