tangyangguang/Esp32Base/src/network/Esp32BaseWiFi.inc
bool Esp32BaseWiFi::clearCredentials() {
    const bool hadSafeBootState = g_staGuardActive || g_staCredentialsPaused || g_staGuardedResetCount != 0;
    const uint8_t previousCount = g_staGuardedResetCount;
    const bool previousPaused = g_staCredentialsPaused;
    g_wifiSsid[0] = '\0';
    g_wifiPassword[0] = '\0';
    g_staGuardActive = false;
    g_staCredentialsPaused = false;
    g_staGuardedResetCount = 0;
    g_wifiInitGuardActive = false;
    g_wifiInitPaused = false;
    g_wifiInitGuardedResetCount = 0;
    if (hadSafeBootState) {
        ESP32BASE_LOG_I("wifi", "sta_safe_boot_cleared reason=credentials_cleared previous_resets=%u previous_paused=%s",
                        static_cast<unsigned>(previousCount),
                        previousPaused ? "yes" : "no");
    }
    const bool ok = Esp32BaseConfig::clearNamespace(WIFI_NS);
    if (!ok) {
        ESP32BASE_LOG_W("wifi", "credential_clear_failed");
    }
    return ok;
}

bool Esp32BaseWiFi::retrySavedCredentials() {
    if (!loadCredentials()) {
        ESP32BASE_LOG_W("wifi", "saved_credentials_retry_failed reason=no_credentials");
        return false;
    }
    g_wifiRetryCount = 0;
    resumeStaCredentials("saved_credentials_retry");
    stopConfigPortal();
    if (beginSta()) {
        ESP32BASE_LOG_I("wifi", "saved_credentials_retry_started ssid=%s", g_wifiSsid);
        return true;
    }
    startConfigPortal();
    return false;
}

bool Esp32BaseWiFi::startConfigPortal() {
    WiFi.mode(WIFI_AP);
    g_wifiRetryCount = 0;
    if (!g_configPortalSsid[0]) {
        snprintf(g_configPortalSsid, sizeof(g_configPortalSsid), "ESP32-Config-%04X",
                 static_cast<unsigned>(readableMacSuffix(ESP.getEfuseMac())));
    }
    const bool ok = WiFi.softAP(g_configPortalSsid);
    g_wifiState = ok ? CONFIG_PORTAL : FAILED;
    if (ok) {
        publish(EVENT_CONFIG_PORTAL);
        char ipAddress[16];
        formatIpv4(WiFi.softAPIP(), ipAddress, sizeof(ipAddress));
        ESP32BASE_LOG_I("wifi", "config_portal_started ssid=%s ip=%s", g_configPortalSsid, ipAddress);
    }
    return ok;
}

bool Esp32BaseWiFi::stopConfigPortal() {
    if (g_wifiState == CONFIG_PORTAL) {
        WiFi.softAPdisconnect(true);
        g_wifiState = IDLE;
    }
    return true;
}

Esp32BaseWiFi::RecoveryButtonConfig Esp32BaseWiFi::recoveryButtonConfig() {
    return g_recoveryButtonConfig;
}

Esp32BaseWiFi::RecoveryButtonConfig Esp32BaseWiFi::defaultRecoveryButtonConfig() {
    RecoveryButtonConfig config = {
        ESP32BASE_ENABLE_WIFI_RECOVERY_BUTTON && ESP32BASE_WIFI_RECOVERY_BUTTON_DEFAULT_ENABLED,
        static_cast<int8_t>(ESP32BASE_WIFI_RECOVERY_BUTTON_GPIO),
        static_cast<uint32_t>(ESP32BASE_WIFI_RECOVERY_BUTTON_HOLD_MS)
    };
    return config;
}

bool Esp32BaseWiFi::setRecoveryButtonConfig(const RecoveryButtonConfig& config) {
#if !ESP32BASE_ENABLE_WIFI_RECOVERY_BUTTON
    (void)config;
    ESP32BASE_LOG_W("wifi", "recovery_button_config_rejected reason=capability_disabled");
    return false;
#else
    if (!isValidRecoveryButtonConfig(config)) {
        ESP32BASE_LOG_W("wifi", "recovery_button_config_rejected enabled=%s gpio=%d hold_ms=%lu",
                        config.enabled ? "yes" : "no",
                        static_cast<int>(config.gpio),
                        static_cast<unsigned long>(config.holdMs));
        return false;
    }
    uint8_t encoded[WIFI_RECOVERY_CONFIG_BYTES];
    encodeRecoveryButtonConfig(config, encoded);
    if (!Esp32BaseConfig::setBlob(WIFI_RECOVERY_NS, WIFI_RECOVERY_KEY, encoded, sizeof(encoded))) {
        ESP32BASE_LOG_W("wifi", "recovery_button_config_save_failed");
        return false;
    }
    uint8_t verify[WIFI_RECOVERY_CONFIG_BYTES];
    if (!Esp32BaseConfig::getBlob(WIFI_RECOVERY_NS, WIFI_RECOVERY_KEY, verify, sizeof(verify)) ||
        memcmp(encoded, verify, sizeof(encoded)) != 0) {
        ESP32BASE_LOG_W("wifi", "recovery_button_config_verify_failed");
        return false;
    }
    applyRecoveryButtonConfig(config);
    ESP32BASE_LOG_W("wifi", "recovery_button_config_saved enabled=%s gpio=%d hold_ms=%lu",
                    config.enabled ? "yes" : "no",
                    static_cast<int>(config.gpio),
                    static_cast<unsigned long>(config.holdMs));
    return true;
#endif
}

bool Esp32BaseWiFi::isValidRecoveryButtonConfig(const RecoveryButtonConfig& config) {
    return validRecoveryButtonConfig(config);
}

bool Esp32BaseWiFi::recoveryButtonTriggered() {
    return g_recoveryButtonTriggeredEver;
}

Esp32BaseWiFi::State Esp32BaseWiFi::state() {
    return g_wifiState;
}

const char* Esp32BaseWiFi::stateName() {
    switch (g_wifiState) {
        case IDLE: return "IDLE";
        case CONNECTING: return "CONNECTING";
        case CONNECTED: return "CONNECTED";
        case CONFIG_PORTAL: return "CONFIG_PORTAL";
        case RETRY_BACKOFF: return "RETRY_BACKOFF";
        case FAILED: return "FAILED";
        default: return "UNKNOWN";
    }
}

bool Esp32BaseWiFi::isConnected() {
    return WiFi.status() == WL_CONNECTED;
}

const char* Esp32BaseWiFi::ssid() {
    return g_wifiSsid;
}

bool Esp32BaseWiFi::safeBootPaused() {
    return g_staCredentialsPaused;
}

uint8_t Esp32BaseWiFi::safeBootGuardedResetCount() {
    return g_staGuardedResetCount;
}

uint32_t Esp32BaseWiFi::attemptCount() { return g_wifiAttemptCount; }

uint8_t Esp32BaseWiFi::retryCount() {
    return g_wifiRetryCount;
}

uint32_t Esp32BaseWiFi::retryRemainingMs() {
    if (g_wifiState != RETRY_BACKOFF) {
        return 0;
    }
    const uint32_t now = millis();
    return static_cast<int32_t>(now - g_wifiNextRetryMs) >= 0 ? 0 : g_wifiNextRetryMs - now;
}

bool Esp32BaseWiFi::ip(char* out, size_t len) {
    if (!out || len == 0) {
        return false;
    }
    const IPAddress address = g_wifiState == CONFIG_PORTAL ? WiFi.softAPIP() : WiFi.localIP();
    return formatIpv4(address, out, len);
}

int32_t Esp32BaseWiFi::rssi() {
    return WiFi.RSSI();
}

void Esp32BaseWiFi::setPowerSave(bool enabled) {
    g_wifiPowerSave = enabled;
    WiFi.setSleep(enabled);
}

bool Esp32BaseWiFi::powerSave() {
    return g_wifiPowerSave;
}

#endif
